# DTM6_SendToSurface

## Description
Modifies the passed object so it lies on the surface of the desired DTM.

```pascal
FUNCTION DTM6_SendToSurface(
				hDTMObject : HANDLE;
				hObject    : HANDLE;
				TINType    : INTEGER) : BOOLEAN;
```

```python

def vs.DTM6_SendToSurface(hDTMObject, hObject, TINType):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hDTMObject|HANDLE||
|hObject|HANDLE||
|TINType|INTEGER||

## Version
Availability: from Vectorworks 2011
## Category
* SiteModel Interface Library